sys/105.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
            &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="105" value="Laboratuvar Sonuç Kayıt" /&gt;
            &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
            &lt;author&gt;
            &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
            &lt;/author&gt;
            &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
            &lt;recordData&gt;
                       
            &lt;TETKIK_SONUC_BILGILERI&gt;
                                <%if(PAKETE_AIT_ISLEM_ZAMANI!=undefined){ %>
                                    &lt;PAKETE_AIT_ISLEM_ZAMANI value="PAKETE_AIT_ISLEM_ZAMANI" /&gt;
                            <% }%>
                            &lt;TETKIK_BILGISI&gt;
                            &lt;ISLEM_REFERANS_NUMARASI value="<%=ISLEM_REFERANS_NUMARASI %>" /&gt;
                            &lt;TETKIK_ORNEK_NUMARASI value="<%=TETKIK_ORNEK_NUMARASI %>" /&gt;
                            &lt;TETKIK_ORNEGININ_ALINDIGI_ZAMAN value="<%=TETKIK_ORNEGININ_ALINDIGI_ZAMAN %>" /&gt;
                            &lt;TETKIK_ORNEGININ_KABUL_ZAMANI value="<%=TETKIK_ORNEGININ_KABUL_ZAMANI %>" /&gt;
                            &lt;TETKIK_SONUC_TARIHI value="<%=TETKIK_SONUC_TARIHI %>" /&gt;
                            &lt;TETKIK_SONUC_ONAY_TARIHI value="<%=TETKIK_SONUC_ONAY_TARIHI %>" /&gt;
                            &lt;SONUC_DIS_ERISIM_BILGISI value="<%=SONUC_DIS_ERISIM_BILGISI %>" /&gt;
                                <% for(var i=0; i < KADIN_SAGLIGI_ISLEMLERI_count; i++) {%>
                                    &lt;TETKIK_SONUC_BILGISI&gt;
                                    &lt;LOINC_KODU value="<%=LOINC_KODU %>" /&gt;
                                    &lt;TETKIK_SONUC_PARAMETRE_ADI value="<%=TETKIK_SONUC_PARAMETRE_ADI %>" /&gt;
                                    &lt;TETKIK_SONUCU value="<%=TETKIK_SONUCU %>" /&gt;
                                    &lt;TETKIK_SONUCU_BIRIMI value="<%=TETKIK_SONUCU_BIRIMI %>" /&gt;
                                    &lt;TETKIK_SONUCU_REFERANS_DEGERI value="<%=TETKIK_SONUCU_REFERANS_DEGERI %>" /&gt;
                                    &lt;TETKIK_SONUCU_REFERANS_DEGER_ARALIGINDA_MI value="<%=TETKIK_SONUCU_REFERANS_DEGER_ARALIGINDA_MI %>" /&gt;
                                    &lt;/TETKIK_SONUC_BILGISI&gt;
                                % }%>
                                &lt;/TETKIK_BILGISI&gt;
                           
                                &lt;/TETKIK_SONUC_BILGILERI&gt;
                     
                                &lt;HASTA_TAKIP_BILGISI&gt;
                                &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                               </input>
                            </SYSSendMessage>
                            </s:Body>
                    </s:Envelope>